[
  {
    "Id": "456963",
    "ThreadId": "216446",
    "Html": "<p>Hi, I'm sorry if&nbsp;my problem has been solved&nbsp;but I'm having a hard time trying to find the solution in your website, so I thought I'd rather ask here.</p>\r\n<p>A) I need my bibliography to sort chronologically, not by author or by order of reference.</p>\r\n<p>B) Also, each&nbsp;source should&nbsp;be numbered, so that the first&nbsp;source listed carries the number one, the second one the number two, and so on.</p>\r\n<p>C) If I add a source&nbsp;to the bibliography, I need the bibliography to adjust accordingly. Let say I have this (of course, years are not accurate):</p>\r\n<p>1- The little prince (1910)</p>\r\n<p>2- A catcher in the rye (1950)</p>\r\n<p>3- Hansel and Gretel (1980)</p>\r\n<p>And now I want to add Cinderella (1955). I should get this:</p>\r\n<p>1- The little prince (1910)</p>\r\n<p>2- A catcher in the rye (1950)</p>\r\n<p><strong>3- Cinderella (1955)</strong></p>\r\n<p>4- Hansel and Gretel (1980)</p>\r\n<p>D) The citations should be in the following style: number, author, year, page.</p>\r\n<p>E) This means that, whenever I add a source to the bibliography which forces renumbering of the sources, all the citations should renumber accordingly.</p>\r\n<p>What do you suggest?</p>",
    "PostedDate": "2010-06-17T14:40:10.703-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "457071",
    "ThreadId": "216446",
    "Html": "<p>A) Just use a sort string which incorporates the date. See the example sorting strings in the <a title=\"Example sorting strings\" href=\"http://bibword.codeplex.com/wikipage?title=BibWord Format Strings&referringTitle=Documentation#ex3\">documentation</a>. There is an example on sorting by date both&nbsp;in ascending and descending order.</p>\r\n<p>B) The basic functionality in Word 2007/2010 does not allow for both sorting and numbering as citations are unlinked from one another. However, you can use the <a title=\"BibWord Extender\" href=\"http://bibword.codeplex.com/wikipage?title=BibWord Extender&referringTitle=Documentation\">BibWord Extender</a> to get around this problem easily. Just look for the <em>BibOrder</em> variable which was specifically constructed to get around such shortcomings. A style demonstrating this principle is the <a title=\"IEEE - Alphabetical Order*\" href=\"http://bibword.codeplex.com/releases/view/19764#DownloadId=49964\">IEEE - Alphabetical Order*</a>.</p>\r\n<p>C) As the BibOrder variable is calculated separately, you will have to let the BibWord Extender program do the recalculation each time an entry is updated. Alternatively, you can just run the program once at the end and it will number everything correctly. If you have cross reference, just update those as well and you should be good to go.</p>\r\n<p>D) Write a format string which does so. See the online documentation on <a title=\"BibWord Format Strings\" href=\"http://bibword.codeplex.com/wikipage?title=BibWord Format Strings&referringTitle=Documentation\">format strings</a>, or check out the <a title=\"Latest version of the guide.\" href=\"http://bibword.codeplex.com/releases/view/36507#DownloadId=94750\">guide</a> containing all variables. A very, very basic string, could look like:</p>\r\n<p>{%BibOrder|&quot;BO&quot;%- }{%Author:1%}{ (%Year%) }</p>\r\n<p>The &quot;BO&quot; string is used to indicate that the value of the BibOrder variable still has to be calculated. Note that if you&nbsp;add sources, the values might become incorrect and mixed in with BO strings. Running the extender program once again will solve this.&nbsp;The '1' after Author indicates&nbsp;which set of rules should&nbsp;be used&nbsp;to format authors. An explaination on&nbsp;how to&nbsp;create formatting information for contributors, see the <a title=\"Formatting contributors.\" href=\"http://bibword.codeplex.com/wikipage?title=BibWord Format Contributors&referringTitle=Documentation\">documentation</a>. For examples on how to format the name of a specific author, see <a title=\"Example format strings for contributors.\" href=\"http://bibword.codeplex.com/wikipage?title=BibWord Format Strings&referringTitle=Documentation#ex2\">here</a>.</p>\r\n<p>E) Run the BibWord Extender program to update. (see C)</p>",
    "PostedDate": "2010-06-17T22:57:55.28-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]