[
  {
    "Id": "535948",
    "ThreadId": "238418",
    "Html": "\r\n<p>Thanks for an EXCELLENT resource that really extends the Word 2007 Citation/Bibliography functionality.</p>\r\n<p>I'm going to be setting up a template for a large Word 2007 document that will be worked on by multiple authors (10 or more), with most authors only working on their section. Some authors may be outside the company I'm working for, but will be provided with\r\n the template. The template and the document sections will be stored on the corporate network, though there will be times when individual parts of the document are downloaded to a local machine (remote workers, 3rd party contractors etc.).</p>\r\n<p>Based on a similar document done in Word 2003,&nbsp;the final bibliography could contain&nbsp;well over 200 references and there could easily be 500 citations throughout the document.</p>\r\n<p>I have been modifying one of the Harvard styles and am fairly comfortable with doing that.</p>\r\n<p>My questions are:</p>\r\n<p>1. If each author adds citations/creates a bibliography for their own section, can I merge them together when I pull the final document together? If so, what's the best practice for doing this?</p>\r\n<p>2. I noticed that there's a file called Sources.xml on my computer that contains all my references -- can I have more than one of these files? Can I rename this file and share it with the other authors so they select references from a standard list? Can\r\n I save my references to another file? (I can't see any way to do this via the Source Manager dialog)</p>\r\n<p>3. Can I distribute my modified Harvard style XSL file to the authors so they are all using the same style, or doesn't it matter? In other words, no matter what they use, when I put the final document together,&nbsp;can I select the modified Harvard style\r\n on my computer and that will overwrite/reformat whatever style they used? What will happen when I send the final document out for review -- will the citations break?</p>\r\n<p>4. I know I'll have to run BibWord Extender to add the letter designations after the dates of documents produced by the same corporate author in the same year. However, If author A cites document A and author B also cites document A, will this get messed\r\n up when I join the docs back together? (i.e. will I end up with two instances of document A and two separate citations for it?)</p>\r\n<p>5. When the authors send me back their sections, do they also need to send me their Sources.xml file so the citations/bibliography entries they've made don't break? How should I deal with multiple Sources.xml files so that they all get merged together? How\r\n do I stop the citations breaking when I update the fields in the main document?</p>\r\n<p>6. Many of the documents we'll be citing will&nbsp;have the same corporate author and start with the same (very long) project&nbsp;name prefacing the title. Is there any way I can modify the Source Manager dialog box&nbsp;so that I can resize it to display\r\n more of the titles?&nbsp;Also, can I&nbsp;modify the list of fields on the Edit Source window to allow for long titles (some of the government and corporate reports I will be including have titles greater than the 230 character limit of the Title field on\r\n the Edit Source window)?</p>\r\n<p>I apologise for the many questions, but I'd really like to use this functionality across a large document set and several authors, and not have to create or check the citations against the references list manually, as we've been doing for some years.</p>\r\n<p>Thanks!</p>\r\n<p>--Rhonda</p>\r\n",
    "PostedDate": "2010-12-14T22:52:17.957-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "536106",
    "ThreadId": "238418",
    "Html": "\r\n<blockquote style=\"border:solid .1em #ccc; font-style:italic; margin:.25em 1em 0 1em; padding:0 .25em 0 .25em\">\r\n<p>1. If each author adds citations/creates a bibliography for their own section, can I merge them together when I pull the final document together? If so, what's the best practice for doing this?</p>\r\n</blockquote>\r\n<p>Yes. A simple document merge won't work here, you will have to do the transfer manually. The easiest way is by opening each document and transfer the sources to your master list. In the final document you can then copy the master list back to the document.</p>\r\n<p>The major issue is with people citing the same source but with a different tag. Word uses the tag of a source as its unique identifier. For Word, if two tags are different, then they belong to different sources. I'm afraid that only manual checking can prevent\r\n the occurrence of 'doubles'.</p>\r\n<blockquote style=\"border:solid .1em #ccc; font-style:italic; margin:.25em 1em 0 1em; padding:0 .25em 0 .25em\">\r\n<p>2. I noticed that there's a file called Sources.xml on my computer that contains all my references -- can I have more than one of these files? Can I rename this file and share it with the other authors so they select references from a standard list? Can\r\n I save my references to another file? (I can't see any way to do this via the Source Manager dialog)</p>\r\n</blockquote>\r\n<p>Yes, yes, and yes.</p>\r\n<p>In the 'Manage Sources' window, there is a 'Browse...' button. This button will allow you to select a master list. So if you have multiple master lists (each with their own name), you can load the one you want to use that way.</p>\r\n<p>If you never change your master list, then it contains a list of all sources you ever entered on your computer using your username. It is not really intended to be portable. Every source you add to your document is also incorporated inside your document.\r\n It might be easier for you to distribute a barebone document which contains all the references you and others will need. That way you won't have to spread a sources.xml file around.</p>\r\n<p>Using the buttons between the two lists under 'Manage Sources', you can easily move references in and out of the reference list of your document.</p>\r\n<blockquote style=\"border:solid .1em #ccc; font-style:italic; margin:.25em 1em 0 1em; padding:0 .25em 0 .25em\">\r\n<p>3. Can I distribute my modified Harvard style XSL file to the authors so they are all using the same style, or doesn't it matter? In other words, no matter what they use, when I put the final document together,&nbsp;can I select the modified Harvard style\r\n on my computer and that will overwrite/reformat whatever style they used? What will happen when I send the final document out for review -- will the citations break?</p>\r\n</blockquote>\r\n<p>Everything stays the same as long as the citations and bibliography fields are not updated. If you are afraid that reviewers will update fields (I don't see any reason why they should), you could consider converting all in-text citations and bibliography\r\n entries to static text. There are macros in the FAQ explaining how to do so in one go. It would be wise to keep a copy with the fields around for later editing.</p>\r\n<blockquote style=\"border:solid .1em #ccc; font-style:italic; margin:.25em 1em 0 1em; padding:0 .25em 0 .25em\">\r\n<p>4. I know I'll have to run BibWord Extender to add the letter designations after the dates of documents produced by the same corporate author in the same year. However, If author A cites document A and author B also cites document A, will this get messed\r\n up when I join the docs back together? (i.e. will I end up with two instances of document A and two separate citations for it?)</p>\r\n</blockquote>\r\n<p>It depends. If the reference is the same, the output will be the same as well. Of course, if you store the same source under two different tags, then different letters will be used. If you are planning on spreading the list of available sources in advance,\r\n then this problem wouldn't occur.</p>\r\n<p>Actually, if you put all your references in your initial document, then run the extender tool and finally mail the document around, then all authors will have a copy where the extensions will be set correctly already.</p>\r\n<blockquote style=\"border:solid .1em #ccc; font-style:italic; margin:.25em 1em 0 1em; padding:0 .25em 0 .25em\">\r\n<p>5. When the authors send me back their sections, do they also need to send me their Sources.xml file so the citations/bibliography entries they've made don't break? How should I deal with multiple Sources.xml files so that they all get merged together? How\r\n do I stop the citations breaking when I update the fields in the main document?</p>\r\n</blockquote>\r\n<p>No. Sources entered when creating the document are stored inside the document as well as the master list. There is no need to transfer master lists (sources.xml).</p>\r\n<p>If you really want to gather and combine master lists, you have two easy ways to combine them. Either by hand by copying each Source element or by abusing the 'Manage Sources' dialog.</p>\r\n<p>The latter is probably easier if you have no idea how xml works. Just open a new empty Word document. Go to the 'Manage Sources' dialog and use the 'Browse...' button to load the first master list. Use the 'Copy -&gt;' button to copy all sources to your\r\n document. Use the 'Browse...' button to open the next master list and repeat this proces. In the end your document will contain all sources from everyone. You can then make a new empty master list (an empty file should work though I haven't tried it) and copy\r\n all your gathered sources in the other direction.</p>\r\n<blockquote style=\"border:solid .1em #ccc; font-style:italic; margin:.25em 1em 0 1em; padding:0 .25em 0 .25em\">\r\n<p>6. Many of the documents we'll be citing will&nbsp;have the same corporate author and start with the same (very long) project&nbsp;name prefacing the title. Is there any way I can modify the Source Manager dialog box&nbsp;so that I can resize it to display\r\n more of the titles?&nbsp;Also, can I&nbsp;modify the list of fields on the Edit Source window to allow for long titles (some of the government and corporate reports I will be including have titles greater than the 230 character limit of the Title field on\r\n the Edit Source window)?</p>\r\n</blockquote>\r\n<p>Yes and no. There is no straightforward way of changing the way things are displayed in the manage sources dialog. However, the entire tool is xml/xslt based, so if you want to delve into it, you can change every representation of sources. The files in &quot;C:\\Program\r\n Files\\Microsoft Office\\Office12\\Bibliography\\Sort&quot; (12 for 2007, 14 for 2010) are responsible for the sorting and displaying of sources in the 'Manage Sources' dialog. So I guess you could pull some trick there with for example the Title.XSL to only show a\r\n part of the title.</p>\r\n<p>The fields should allow up to 255 characters. The first specification of Open XML (ECMA) had this defined as a limit. This was changed with the ISO version of the specification (Office 2010) but unfortunately MS did not follow their own specification although\r\n this specific issue was brought up with the people responsible for this part of Word... I haven't tried this with titles, but I know you can get around it with authors by copy/pasting data inside the fields instead of typing it (so much for correct input validation...).</p>\r\n<blockquote style=\"border:solid .1em #ccc; font-style:italic; margin:.25em 1em 0 1em; padding:0 .25em 0 .25em\">\r\n<p>I apologise for the many questions, but I'd really like to use this functionality across a large document set and several authors, and not have to create or check the citations against the references list manually, as we've been doing for some years.</p>\r\n</blockquote>\r\n<p>A good way of writing is to start from a good base. Everybody should have their reference list ready before they start writing. The worst that can happen is that they are not using some of the sources in their list. If you can get all those in advance, you\r\n can combine them into one 'base' document. If everybody starts from that document, then managing&nbsp;it will be easy. If not, you will have to go over the documents as you combine them. There really is no way of stopping people to use the same source with\r\n a different tag or with a different amount of details.</p>\r\n",
    "PostedDate": "2010-12-15T06:11:16.757-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "536442",
    "ThreadId": "238418",
    "Html": "\r\n<p>Yves -- thank you SO MUCH for such a comprehensive and prompt reply. It's good to know that I can do most of what I was hoping to do. Your advice about making sure the authors have their reference list together before writing and giving it to me to make\r\n into one Company_Sources.xml file that I then deliver to them all is a great one -- now to see if we can get them to do that!</p>\r\n<p>Thanks again</p>\r\n<p>--Rhonda</p>\r\n",
    "PostedDate": "2010-12-15T14:44:52.097-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]