[
  {
    "Id": "595386",
    "ThreadId": "253424",
    "Html": "\r\n<p>Hello everyone.</p>\r\n<p>Even after reading the guide I still don't understand how to use the BibWord and which packages I need to install to edit the citation styles?</p>\r\n<p>Can MS-Word .xls styles be directly edited, or do they have to be somehow converted first?</p>\r\n<p>Does BibWord only extends the MSW functionality, or does it provide some kind of editor to edit the stylesheets?</p>\r\n<p>Is there a tutorial or anything else besides of the guide for unexperienced users? Or may be somebody can help me step-by-step? All I want to achieve is to make my reference list to look exactly like if I'm using the namesorted german GOST style, but to\r\n have numbers in front of names and to use these numbers in sq&uacute;are brackets for citations like in the IEEE alphabetical sorted style.</p>\r\n<p>Best,</p>\r\n",
    "PostedDate": "2011-04-11T08:58:24.577-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "595534",
    "ThreadId": "253424",
    "Html": "<blockquote style=\"padding-bottom: 0px; font-style: italic; margin: 0.25em 1em 0px; padding-left: 0.25em; padding-right: 0.25em; padding-top: 0px; border: #ccc 0.1em solid;\">\r\n<p>Even after reading the guide I still don't understand how to use the BibWord and which packages I need to install to edit the citation styles?</p>\r\n</blockquote>\r\n<p>There is nothing to install. Each style is contained within a single XSL file. Drop the XSL file in the correct folder, restart Word, and the style should be available.</p>\r\n<p>There exists an extender program which provides some extra functionality which Word cannot offer. But it is not required and it is a standalone exe without any installation procedure.</p>\r\n<blockquote style=\"padding-bottom: 0px; font-style: italic; margin: 0.25em 1em 0px; padding-left: 0.25em; padding-right: 0.25em; padding-top: 0px; border: #ccc 0.1em solid;\">\r\n<p>Can MS-Word .xls styles be directly edited, or do they have to be somehow converted first?</p>\r\n</blockquote>\r\n<p>Any text editor (e.g. notepad) can be used to edit the xsl. If you have one, I would suggest an xml editor as it is slightly easier to see where tags start and stop.</p>\r\n<blockquote style=\"padding-bottom: 0px; font-style: italic; margin: 0.25em 1em 0px; padding-left: 0.25em; padding-right: 0.25em; padding-top: 0px; border: #ccc 0.1em solid;\">\r\n<p>Does BibWord only extends the MSW functionality, or does it provide some kind of editor to edit the stylesheets?</p>\r\n</blockquote>\r\n<p>There currently is no editor. I had some basic code ideas worked out but never had the time to finish it. There are some people who requested and received the code, but none have made an editor available.</p>\r\n<p>BibWord does not extend the functionality offered by Word. It is a simple template to make new styles more easily. Basically a style is an XSL file containing 3000 or more lines of code. If you take a look at the styles that come with Word, you will soon learn that replacing a simple comma by a semi colon is a nightmare and might take you hours of searching through the code to achieve your goal. BibWord works differently. It also contains 3000 lines of code, but everything which makes your style (how to format an author name, title, ...) is located in under 200 lines which are easily identifiable and highely structured. Doing the same operation described above is done in a few minutes and if you know what you are doing even in a few seconds.</p>\r\n<blockquote style=\"padding-bottom: 0px; font-style: italic; margin: 0.25em 1em 0px; padding-left: 0.25em; padding-right: 0.25em; padding-top: 0px; border: #ccc 0.1em solid;\">\r\n<p>Is there a tutorial or anything else besides of the guide for unexperienced users? Or may be somebody can help me step-by-step? All I want to achieve is to make my reference list to look exactly like if I'm using the namesorted german GOST style, but to have numbers in front of names and to use these numbers in sq&uacute;are brackets for citations like in the IEEE alphabetical sorted style.</p>\r\n</blockquote>\r\n<p>Not really. You want to edit one of the styles which come with Word and which are completely unstructured. I don't do that kind of editing anymore. You might find some old newsgroup posts on this subject when using Google which describe some things I did with the original styles in the past. They might help you along.</p>\r\n<p>However, what you want is not possible with the styles which come with Word. Word lacks the features to sort a bibliography by name and use numbers to refer to the entries at the same time. The extender program of BibWord provides this type of capabilities but using it will require you to recreate the entire style from scratch in the BibWord format.</p>",
    "PostedDate": "2011-04-11T14:09:06.5-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "595755",
    "ThreadId": "253424",
    "Html": "<p>Thank you yves, I've got the point.</p>\r\n<p>I'll keep writing my thesis and stick either to a default MS-style or to one of your templates, and at the end if there is enough time left, I'll try to customize the template.</p>\r\n<p>Thanks a lot once again!</p>\r\n<p>Best regards</p>",
    "PostedDate": "2011-04-12T02:13:48.943-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]