[
  {
    "Id": "643922",
    "ThreadId": "265617",
    "Html": "\r\n<p>Hi, Yves. I've been confronted with a demanding bibliography style for a periodical. The author/editor must be in the first line, no indentation, in small caps (!), the second line (actually, a new paragraph with line space 1) starts with the year of publication\r\n and the rest of the information comes indented. I can handle this second part, but I have no idea how to make the two lines nor how to change only the first line to small caps. Can you please give me a hand or a hint on this? Merc&igrave; beaucoup.</p>\r\n<p>Rafael J</p>\r\n",
    "PostedDate": "2011-07-18T13:16:17.69-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "645402",
    "ThreadId": "265617",
    "Html": "<p>I currently don't have the time to try it, but you could try adding</p>\r\n<p style=\"padding-left: 30px;\">&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;</p>\r\n<p>in the middle of your format string. As a bibliography entry is normally just a paragraph and wrapped between &lt;p&gt; and &lt;/p&gt;, adding &amp;lt;/p&amp;gt;&amp;lt;p&amp;gt; might trick&nbsp;the creation of a&nbsp;second paragraph. If it works, I would try</p>\r\n<p style=\"padding-left: 30px;\">&amp;lt;/p&amp;gt;&amp;lt;p class=\"msobibliography\"&amp;gt;</p>\r\n<p>That way you could set the formatting directly in Word through the bibliography style.</p>",
    "PostedDate": "2011-07-21T01:01:10.08-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "645770",
    "ThreadId": "265617",
    "Html": "<p>Oh, that was nice. I had already tried myself with &lt;br&gt;, but it just inserted a line break, with the expectaed complications. The &lt;p&gt;&lt;/p&gt; tags do the trick, to some extent. As I need small caps for the first line, and don't want this line to be spaced different, I actually have to define a second style for this line only and apply it individually. No way, I understand I have to do it. But What I also would like to know is how to insert a Tab in the xml code so I can align things better in my second paragraph. What's the code for that (if there's any)? I've tried with &amp;#009; and &amp;#9; with no results.</p>\r\n<p>But thanks a lot for your time and your reply.</p>\r\n<p>Rafael J</p>",
    "PostedDate": "2011-07-21T13:07:30.173-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "645780",
    "ThreadId": "265617",
    "Html": "<p>Wrap the small-caps line in a span to overwrite the default style and you should be fine.</p>\r\n<p>Something like</p>\r\n<p style=\"padding-left: 30px;\">&amp;lt;span style=\"font-variant: small-caps\"&amp;gt;%Author:0%&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;</p>\r\n<p>Tabs are probably possible if you wrap then inside a cdata element but I never tried it:</p>\r\n<p style=\"padding-left: 30px;\">&amp;lt;![cdata[&amp;#9;]]&amp;gt;</p>\r\n<p>But tabs are generally a bad idea to use since alignment can shift too easily.</p>",
    "PostedDate": "2011-07-21T13:30:33.867-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]