[
  {
    "Id": "160752",
    "ThreadId": "48172",
    "Html": "Hi,<br>\r\nA while ago I submitted an essay using the standard auto updating bibliography in Word, but lost marks because the references were not in the style required. I had a try of all the reference styles and none seemed to be exactly as required. It ended up with me doing the second essay's references by hand, which was such a pain due to the numbers becoming out of sync when other references were added. I have now downloaded and installed all these great bibliography styles from here, but even with that large list, I cannot find one that matches the style specified. The style is:<br>\r\n<br>\r\n2. Lambert, C., Evans, K,J., Till, R., Hobley, L. (2006) Characterizing the flagellar filament and the role of motility in bacterial prey penetration by Bdellovibrio bacteriovorus. Mol. Microbiol. 60: 274-286<br>\r\n<br>\r\nWhich is:<br>\r\n(Number of reference) (Authors) (Year) (Title) (Journal name) (volume no. of journal) (page numbers)<br>\r\n<br>\r\nAnd the reference within the text is supposed to be (2) or similar<br>\r\n<br>\r\nThe closest style to this I could find is &quot;chicago numbered extension&quot; which is almost perfect except the (year) in that style is between the (journal name) and (volume no. of journal), whereas it needs to be between (authors) and (title). <br>\r\nWould it be possible to modify the style so that the year is moved in this way? because the examiners are very picky and would reduce the mark because of this tiny difference.<br>\r\n<br>\r\nIf you could please modify the style into a new download file or something, I would be immeasurably grateful.<br>\r\n<br>\r\nThanks a lot,<br>\r\n<br>\r\nAndrew \r\n",
    "PostedDate": "2009-02-22T16:50:48.02-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "160870",
    "ThreadId": "48172",
    "Html": "If I would change it, I would like to do so 'perfectly' and that is just a bit too hard. It is not a BibWord style. So it is not as if you can just place year from one position to another. The displaying of the year is completely entangled in several template functions depending on the source type and available data:<br>\r\n<ul>\r\n    <li>templateCPY (city, publisher, year)</li>\r\n    <li>templateIYP (issue, year, pages)</li>\r\n    <li>templateVYP (volume, year, pages)</li>\r\n    <li>templateRYM (recordingnumber, year, medium)</li>\r\n    <li>templateIY (institution, year)</li>\r\n    <li>templateDY (distributor, year)</li>\r\n    <li>templateVIYP (volume, issue, year, pages)</li>\r\n    <li>templateJVIDP (journal, volume, issue, date(year), pages)</li>\r\n</ul>\r\n<p>And then there are probably still a few I have overlooked. So the first thing you would have to do is update those so that the year gets no longer displayed where it is displayed now. (It might do the trick if you just replace b:Year with b:Year2 in those templates but I haven't tested it.)<br>\r\n<br>\r\nThen you would have to place the year where you want. For that you would have to check out all 17 entries and put it somewhere based on your specifications. The thing is, it becomes complicated when you have to check for anonymous works where the title should be displayed first followed by the year.<br>\r\n<br>\r\nNote that even then there would probably be a lot of differences between your style and this chicago derivation: article title between quotes, journal name in italics, ... If you only have a few types to do, you should consider using one of the BibWord styles and adjust that one to your needs (or create one from scratch). It would be a lot easier to do so and you could even sort your data alphabetically if you wanted.</p>\r\n",
    "PostedDate": "2009-02-23T01:46:36.107-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]